; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link joint angle)

(:predicates
	(Connected ?j - joint ?l - link) 
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?a - angle ?j - joint)
	(Affected ?j - joint ?l - link ?j1 - joint)
	(Fixed ?l - link)
)

(:action increase_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(Connected ?joint ?link1)
	(Connected ?joint  ?link2)
	(not (Fixed ?link1))
	(not (= ?link1 ?link2))
	(HasAngle ?a1 ?joint)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?joint)) 
	    (HasAngle ?a2 ?joint)
	    (forall (?js - joint ?a3 ?a4 - angle )
		    (when (and (Affected ?js ?link1 ?joint) (not (= ?js ?joint)) (HasAngle ?a3 ?js) (AngleOrd ?a3 ?a4))
		        (and
			        (not (HasAngle ?a3 ?js))
			        (HasAngle ?a4 ?js)
		        )
		    )
	    )
    )
)


(:action decrease_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(Connected ?joint ?link1)
	(Connected ?joint  ?link2)
	(not (Fixed ?link1))
	(not (= ?link1 ?link2))
	(HasAngle ?a1 ?joint)
	(AngleOrd ?a2 ?a1)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?joint)) 
	    (HasAngle ?a2 ?joint)
	    (forall (?js - joint ?a3 ?a4 - angle )
		    (when (and (Affected ?js ?link1 ?joint) (not (= ?js ?joint)) (HasAngle ?a3 ?js) (AngleOrd ?a4 ?a3))
		        (and
			        (not (HasAngle ?a3 ?js))
			        (HasAngle ?a4 ?js)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_1)
(:domain joint_bar)
(:objects
    link_ground link1 link2 link3 link4 link5 link6 link7 - link
    joint1 joint2 joint3 joint4 joint5 joint6 joint7 - joint
    angle0 angle90 angle180 angle270 - angle)
(:init
    (AngleOrd angle0 angle90)
    (AngleOrd angle90 angle180)
    (AngleOrd angle180 angle270)
    (AngleOrd angle270 angle0)

    (Affected joint1 link1 joint2)
    (Affected joint1 link2 joint3)
    (Affected joint1 link3 joint4)
    (Affected joint1 link4 joint5)
    (Affected joint1 link5 joint6)
    (Affected joint1 link6 joint7)
    (Affected joint2 link1 joint1)
    (Affected joint2 link2 joint3)
    (Affected joint2 link3 joint4)
    (Affected joint2 link4 joint5)
    (Affected joint2 link5 joint6)
    (Affected joint2 link6 joint7)
    (Affected joint3 link1 joint1)
    (Affected joint3 link2 joint2)
    (Affected joint3 link3 joint4)
    (Affected joint3 link4 joint5)
    (Affected joint3 link5 joint6)
    (Affected joint3 link6 joint7)
    (Affected joint4 link1 joint1)
    (Affected joint4 link2 joint2)
    (Affected joint4 link3 joint3)
    (Affected joint4 link4 joint5)
    (Affected joint4 link5 joint6)
    (Affected joint4 link6 joint7)
    (Affected joint5 link1 joint1)
    (Affected joint5 link2 joint2)
    (Affected joint5 link3 joint3)
    (Affected joint5 link4 joint4)
    (Affected joint5 link5 joint6)
    (Affected joint5 link6 joint7)
    (Affected joint6 link1 joint1)
    (Affected joint6 link2 joint2)
    (Affected joint6 link3 joint3)
    (Affected joint6 link4 joint4)
    (Affected joint6 link5 joint5)
    (Affected joint6 link6 joint7)
    (Affected joint7 link1 joint1)
    (Affected joint7 link2 joint2)
    (Affected joint7 link3 joint3)
    (Affected joint7 link4 joint4)
    (Affected joint7 link5 joint5)
    (Affected joint7 link6 joint6)

    (Connected joint1 link_ground)
    (Connected joint1 link1)
    (Connected joint2 link1)
    (Connected joint2 link2)
    (Connected joint3 link2)
    (Connected joint3 link3)
    (Connected joint4 link3)
    (Connected joint4 link4)
    (Connected joint5 link4)
    (Connected joint5 link5)
    (Connected joint6 link5)
    (Connected joint6 link6)
    (Connected joint7 link6)
    (Connected joint7 link7)

    (Fixed link_ground)

    (HasAngle angle270 joint1)
    (HasAngle angle90 joint2)
    (HasAngle angle270 joint3)
    (HasAngle angle0 joint4)
    (HasAngle angle180 joint5)
    (HasAngle angle90 joint6)
    (HasAngle angle270 joint7)
)
(:goal
(and
    (HasAngle angle90 joint1)
    (HasAngle angle90 joint2)
    (HasAngle angle0 joint3)
    (HasAngle angle180 joint4)
    (HasAngle angle0 joint5)
    (HasAngle angle90 joint6)
    (HasAngle angle0 joint7)
    )
)
)

; plan
1. (increase_angle link4 link5 joint5 angle180 angle270)
   deleted: (hasangle angle180 joint5) (hasangle angle270 joint1) (hasangle angle90 joint2) (hasangle angle270 joint3) (hasangle angle0 joint4)
   added: (hasangle angle270 joint5) (hasangle angle0 joint1) (hasangle angle180 joint2) (hasangle angle0 joint3) (hasangle angle90 joint4)
   goals met: 2 of 7
2. (increase_angle link6 link5 joint6 angle90 angle180)
   deleted: (hasangle angle90 joint6) (hasangle angle270 joint7)
   added: (hasangle angle180 joint6) (hasangle angle0 joint7)
   goals met: 2 of 7
3. (increase_angle link4 link5 joint5 angle270 angle0)
   deleted: (hasangle angle270 joint5) (hasangle angle0 joint1) (hasangle angle180 joint2) (hasangle angle0 joint3) (hasangle angle90 joint4)
   added: (hasangle angle0 joint5) (hasangle angle90 joint1) (hasangle angle270 joint2) (hasangle angle90 joint3) (hasangle angle180 joint4)
   goals met: 4 of 7
4. (increase_angle link7 link6 joint7 angle0 angle90)
   deleted: (hasangle angle0 joint7)
   added: (hasangle angle90 joint7)
   goals met: 3 of 7
5. (increase_angle link1 link2 joint2 angle270 angle0)
   deleted: (hasangle angle270 joint2) (hasangle angle90 joint1)
   added: (hasangle angle0 joint2) (hasangle angle180 joint1)
   goals met: 2 of 7
6. (increase_angle link3 link2 joint3 angle90 angle180)
   deleted: (hasangle angle90 joint3) (hasangle angle180 joint4) (hasangle angle0 joint5) (hasangle angle180 joint6) (hasangle angle90 joint7)
   added: (hasangle angle180 joint3) (hasangle angle270 joint4) (hasangle angle90 joint5) (hasangle angle270 joint6) (hasangle angle180 joint7)
   goals met: 0 of 7
7. (decrease_angle link2 link3 joint3 angle180 angle90)
   deleted: (hasangle angle180 joint3) (hasangle angle180 joint1) (hasangle angle0 joint2)
   added: (hasangle angle90 joint3) (hasangle angle90 joint1) (hasangle angle270 joint2)
   goals met: 1 of 7
8. (decrease_angle link6 link5 joint6 angle270 angle180)
   deleted: (hasangle angle270 joint6) (hasangle angle180 joint7)
   added: (hasangle angle180 joint6) (hasangle angle90 joint7)
   goals met: 1 of 7
9. (decrease_angle link2 link1 joint2 angle270 angle180)
   deleted: (hasangle angle270 joint2) (hasangle angle90 joint3) (hasangle angle270 joint4) (hasangle angle90 joint5) (hasangle angle180 joint6) (hasangle angle90 joint7)
   added: (hasangle angle180 joint2) (hasangle angle0 joint3) (hasangle angle180 joint4) (hasangle angle0 joint5) (hasangle angle90 joint6) (hasangle angle0 joint7)
   goals met: 6 of 7
10. (decrease_angle link2 link1 joint2 angle180 angle90)
   deleted: (hasangle angle180 joint2) (hasangle angle0 joint3) (hasangle angle180 joint4) (hasangle angle0 joint5) (hasangle angle90 joint6) (hasangle angle0 joint7)
   added: (hasangle angle90 joint2) (hasangle angle270 joint3) (hasangle angle90 joint4) (hasangle angle270 joint5) (hasangle angle0 joint6) (hasangle angle270 joint7)
   goals met: 2 of 7
11. (increase_angle link3 link2 joint3 angle270 angle0)
   deleted: (hasangle angle270 joint3) (hasangle angle90 joint4) (hasangle angle270 joint5) (hasangle angle0 joint6) (hasangle angle270 joint7)
   added: (hasangle angle0 joint3) (hasangle angle180 joint4) (hasangle angle0 joint5) (hasangle angle90 joint6) (hasangle angle0 joint7)
   goals met: 7 of 7
